/* import { Chat } from '../types';

export const SAMPLE_CHATS: Chat[] = [
  {
    id: 1,
    nickname: '튼튼한바다거북1238', // self가 false 이므로
    color: '#ffffff', // 기본 흰색
    message: '안녕하세요! 채팅방에 오신 것을 환영합니다.',
    created_at: '2023-03-10T10:00:00.000Z',
  },
  {
    id: 2,
    nickname: '깔끔한퓨마4350', // self가 true 이므로
    color: '#87a724', // 내 메시지는 연한 초록색
    message: '안녕하세요, 저는 익명 사용자입니다.',
    created_at: '2023-03-10T10:01:00.000Z',
  },
  {
    id: 3,
    nickname: '튼튼한바다거북1238',
    color: '#ffffff',
    message: '오늘 날씨가 참 좋네요.',
    created_at: '2023-03-10T10:02:00.000Z',
  },
  {
    id: 4,
    nickname: '깔끔한퓨마4350',
    color: '#87a724',
    message: '정말 그렇네요! 채팅으로 소통해봐요.',
    created_at: '2023-03-10T10:03:00.000Z',
  },
  {
    id: 5,
    nickname: '깔끔한퓨마4350',
    color: '#87a724',
    message: 'ㅇㅇ',
    created_at: '2023-03-10T10:04:00.000Z',
  },
  {
    id: 6,
    nickname: '튼튼한바다거북1238',
    color: '#ffffff',
    message:
      '한 가지 주의할 점이 있습니다. 위의 바로가기를 따라가면 나오는 MySQL Workbench 버전은 특정 버전 이상의 macOS에서만 문제없이 작동한다는 점인데요. 자신의 macOS 버전이 Big Sur(11.1) 이하 버전이라면 MySQL Workbench (Archived Versions) 바로가기에서 아래 화면의 빨간색 박스 위치의 문구를 살펴가며, 자신의 macOS에 맞는 버전을 다운로드해 주세요.',
    created_at: '2023-03-10T10:05:00.000Z',
  },
  {
    id: 7,
    nickname: '깔끔한퓨마4350',
    color: '#87a724',
    message: `이시바 총리는 이날 오전 NHK TV 프로그램에 출연해 지난 7일(현지시간) 미국 백악관에서 열린 미일 정상회담과 관련해 “구체적으로 일본 자동차에 대한 관세 이야기는 나오지 않았다”고 말했다.
  
  그는 미일 정상회담에서 일본 방위비 증액 요구가 있었는지에 대한 질문에 “없었다”며 “그것은 일본이 판단할 것”이라고 답했다.
  
  이시바 총리는 일본제철의 US스틸 인수 계획에 대해 “단순한 인수가 아니다. 투자해서 어디까지나 계속 미국 회사로 있을 것”이라고 말했다.`,
    created_at: '2023-03-10T10:06:00.000Z',
  },
  {
    id: 8,
    nickname: '튼튼한바다거북1238',
    color: '#ffffff',
    message: `영국 일간 텔레그래프는 이스라엘 소식통을 인용, 이스라엘이 가자 주민 이주지로 모로코와 소말리아 북부 반자치주인 푼틀란드·소말릴란드 등을 검토하고 있다고 보도했다.
  
  이스라엘의 태평양 남서부 총영사인 이스라엘 바차르는 미국 CBS방송과의 인터뷰에서 가자 주민들의 이주지로 “모로코 1곳, 소말리아 북부 2곳을 이야기하고 있다”며 그중 한 곳이 푼틀란드라고 말했다.
  
  베냐민 네타냐후 이스라엘 총리와 가까운 이스라엘 언론인 아미트 세갈도 텔레그래프에 이스라엘이 팔레스타인인들을 푼틀란드, 소말릴란드, 모로코로 보내기 위해 검토하려는 동향이 있다고 전했다.
  
  푼틀란드와 소말릴란드는 1998년과 1991년 각각 소말리아로부터 독립을 선언했다. 하지만, 아직 국제사회에서 별개 국가로 공식 인정을 받지는 못했다.`,
    created_at: '2023-03-10T10:07:00.000Z',
  },
];
 */
